cases/05_navier_stokes_equation/17_lid_driven_cavity_piso_Re1000_hybrid80/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottomWall
    {
        type            patch;
        physicalType    patch;
        nFaces          10;
        startFace       13967;
    }
    leftWall
    {
        type            patch;
        physicalType    patch;
        nFaces          10;
        startFace       13977;
    }
    rightWall
    {
        type            patch;
        physicalType    patch;
        nFaces          10;
        startFace       13987;
    }
    movingTop
    {
        type            patch;
        physicalType    patch;
        nFaces          10;
        startFace       13997;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          9282;
        startFace       14007;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          9282;
        startFace       23289;
    }
)

// ************************************************************************* //
