cases/05_navier_stokes_equation/17_lid_driven_cavity_piso_Re1000_hybrid80/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /    O  peration     |
    \  /    A nd           |
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

PISO
{
    // 第五题的 PISO 参数入口。
    nCorrectors 2;
    nNonOrthogonalCorrectors 1;
    pRefCell 0;
    pRefValue 0;
    momentumPredictor yes;
}

solvers
{
    U
    {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-08;
        relTol 0;
    }



    p
    {
        solver GAMG;
        tolerance 1e-08;
        relTol 0;
        smoother GaussSeidel;
    }

    // 末次压力校正使用 pFinal；PISO 与 projection 都保留这一入口。
    pFinal
    {
        $p;
        relTol 0;
    }
}
